#!/usr/bin/env ruby -w
# encoding: UTF-8
require_relative '../SCRF/加载'
require_relative '代码/加载'
需要 'C性能分析'

忽略错误 do
  琼脂 = C琼脂.新建(3000, 3000)
  主视角显示 = C主视角显示.新建
  shink = C细胞.新建('Shink', 200, 40, 'red', C细胞自动控制器.新建)#C细胞鼠标控制器.新建
  主视角显示.设置宿主对象(shink)
  琼脂.添加细胞(shink)
  4.次{|i| 琼脂.添加细胞(C细胞.新建(i.字符串, 200, 40, nil, C细胞自动控制器.新建))}
  琼脂.卵刷新设置(0.8, 100000)
  琼脂.时间同步(0.001, 80)
  #~ 琼脂.效率计算
  #~ C性能分析.开始
  琼脂.运行
  #~ R文件.打开('C:\Users\pc\Desktop\out.html', 'w'){|文件| C性能分析.结束.生成(:调用栈).写入(文件)}
  #~ R单元测试.运行#(['-v'])
end
